
## Plan Result (prod_gameserver)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 13 to add, 2 to change, 13 to destroy.</code></pre>

* Update
  * azurerm_subnet.this
  * cloudflare_record.records[&#34;wings&#34;]
* Replace
  * azuread_group_member.kv_reader[&#34;wings&#34;]
  * azurerm_public_ip.this[&#34;wings&#34;]
  * azurerm_role_assignment.reader[&#34;wings&#34;]
  * azurerm_virtual_machine_extension.setup_twingate[&#34;wings&#34;]
  * module.pterodactyl_node[&#34;wings&#34;].azurerm_dev_test_global_vm_shutdown_schedule.this[0]
  * module.pterodactyl_node[&#34;wings&#34;].azurerm_key_vault.this
  * module.pterodactyl_node[&#34;wings&#34;].azurerm_key_vault_secret.privatekey[0]
  * module.pterodactyl_node[&#34;wings&#34;].azurerm_key_vault_secret.publickey[0]
  * module.pterodactyl_node[&#34;wings&#34;].azurerm_key_vault_secret.username[0]
  * module.pterodactyl_node[&#34;wings&#34;].azurerm_linux_virtual_machine.this
  * module.pterodactyl_node[&#34;wings&#34;].azurerm_network_interface.this
  * module.pterodactyl_node[&#34;wings&#34;].azurerm_virtual_machine_extension.aadlogin[0]
  * module.pterodactyl_node[&#34;wings&#34;].azurerm_virtual_machine_extension.customscript


<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_group_member.kv_reader["wings"] must be replaced
-/+ resource "azuread_group_member" "kv_reader" {
      ~ id               = "9edd55d1-288c-482b-84a3-508efac9e683/member/639552e7-9fde-4116-9f69-dba32041c3b3" -> (known after apply)
      ~ member_object_id = "639552e7-9fde-4116-9f69-dba32041c3b3" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # azurerm_public_ip.this["wings"] must be replaced
-/+ resource "azurerm_public_ip" "this" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Network/publicIPAddresses/wings-prod-pip" -> (known after apply)
      ~ ip_address              = "51.143.187.54" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "wings-prod-pip"
      ~ sku                     = "Basic" -> "Standard" # forces replacement
        tags                    = {
            "application" = "gameservers"
            "environment" = "prod"
        }
      - zones                   = [] -> null
        # (8 unchanged attributes hidden)
    }

  # azurerm_role_assignment.reader["wings"] must be replaced
-/+ resource "azurerm_role_assignment" "reader" {
      ~ id                                     = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/common/providers/Microsoft.KeyVault/vaults/bancey-vault/providers/Microsoft.Authorization/roleAssignments/363d00e8-3b6a-e440-847b-649232195cf3" -> (known after apply)
      ~ name                                   = "363d00e8-3b6a-e440-847b-649232195cf3" -> (known after apply)
      ~ principal_id                           = "639552e7-9fde-4116-9f69-dba32041c3b3" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_subnet.this will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Network/virtualNetworks/games-prod-vnet/subnets/games-prod-subnet"
        name                                          = "games-prod-subnet"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.setup_twingate["wings"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "setup_twingate" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Compute/virtualMachines/wings-prod-vm/extensions/SetupTwingate" -> (known after apply)
        name                        = "SetupTwingate"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "application" = "gameservers"
            "environment" = "prod"
        }
      ~ virtual_machine_id          = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Compute/virtualMachines/wings-prod-vm" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # cloudflare_record.records["wings"] will be updated in-place
  ~ resource "cloudflare_record" "records" {
        id              = "55a63964a75c21c59a25b261a29b19ab"
        name            = "wings-prod"
        tags            = []
      ~ value           = "51.143.187.54" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.pterodactyl_node["wings"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.pterodactyl_node["wings"].data.azurerm_public_ip.existing[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_public_ip" "existing" {
      + allocation_method       = (known after apply)
      + ddos_protection_mode    = (known after apply)
      + ddos_protection_plan_id = (known after apply)
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = (known after apply)
      + ip_address              = (known after apply)
      + ip_tags                 = (known after apply)
      + ip_version              = (known after apply)
      + location                = (known after apply)
      + name                    = "wings-prod-pip"
      + resource_group_name     = "games-prod-rg"
      + reverse_fqdn            = (known after apply)
      + sku                     = (known after apply)
      + tags                    = (known after apply)
      + zones                   = (known after apply)
    }

  # module.pterodactyl_node["wings"].data.azurerm_resource_group.existing[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "existing" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "games-prod-rg"
      + tags       = (known after apply)
    }

  # module.pterodactyl_node["wings"].azurerm_dev_test_global_vm_shutdown_schedule.this[0] must be replaced
-/+ resource "azurerm_dev_test_global_vm_shutdown_schedule" "this" {
      ~ id                    = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-wings-prod-vm" -> (known after apply)
      ~ location              = "uksouth" # forces replacement -> (known after apply) # forces replacement
      - tags                  = {} -> null
      ~ virtual_machine_id    = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Compute/virtualMachines/wings-prod-vm" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pterodactyl_node["wings"].azurerm_key_vault.this must be replaced
-/+ resource "azurerm_key_vault" "this" {
      ~ access_policy                   = [
          - {
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "9edd55d1-288c-482b-84a3-508efac9e683"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "efc9b6c0-5193-43b1-a5a7-2ef3f29cd613"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "a9ab096b-c48d-429e-b255-29dae29cb0e1"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "efc9b6c0-5193-43b1-a5a7-2ef3f29cd613"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.KeyVault/vaults/wings-prod-kv" -> (known after apply)
      ~ location                        = "uksouth" # forces replacement -> (known after apply) # forces replacement
        name                            = "wings-prod-kv"
      - purge_protection_enabled        = false -> null
        tags                            = {
            "DiscordControl" = "true"
            "application"    = "pterodactyl"
            "environment"    = "prod"
        }
      ~ tenant_id                       = "efc9b6c0-5193-43b1-a5a7-2ef3f29cd613" -> (known after apply)
      ~ vault_uri                       = "https://wings-prod-kv.vault.azure.net/" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ contact {
          + access_policy                   = (known after apply)
          + enable_rbac_authorization       = (known after apply)
          + enabled_for_deployment          = (known after apply)
          + enabled_for_disk_encryption     = (known after apply)
          + enabled_for_template_deployment = (known after apply)
          + id                              = (known after apply)
          + location                        = (known after apply)
          + name                            = (known after apply)
          + public_network_access_enabled   = (known after apply)
          + purge_protection_enabled        = (known after apply)
          + resource_group_name             = (known after apply)
          + sku_name                        = (known after apply)
          + soft_delete_retention_days      = (known after apply)
          + tags                            = (known after apply)
          + tenant_id                       = (known after apply)
          + vault_uri                       = (known after apply)
        } -> (known after apply)

      ~ network_acls {
          + access_policy                   = (known after apply)
          + enable_rbac_authorization       = (known after apply)
          + enabled_for_deployment          = (known after apply)
          + enabled_for_disk_encryption     = (known after apply)
          + enabled_for_template_deployment = (known after apply)
          + id                              = (known after apply)
          + location                        = (known after apply)
          + name                            = (known after apply)
          + public_network_access_enabled   = (known after apply)
          + purge_protection_enabled        = (known after apply)
          + resource_group_name             = (known after apply)
          + sku_name                        = (known after apply)
          + soft_delete_retention_days      = (known after apply)
          + tags                            = (known after apply)
          + tenant_id                       = (known after apply)
          + vault_uri                       = (known after apply)
        } -> (known after apply)
    }

  # module.pterodactyl_node["wings"].azurerm_key_vault_secret.privatekey[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "privatekey" {
      ~ id                      = "https://wings-prod-kv.vault.azure.net/secrets/wings-prod-privatekey/05331dd62be84eca9b134d7dfe6886bd" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.KeyVault/vaults/wings-prod-kv" # forces replacement -> (known after apply) # forces replacement
        name                    = "wings-prod-privatekey"
      ~ resource_id             = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.KeyVault/vaults/wings-prod-kv/secrets/wings-prod-privatekey/versions/05331dd62be84eca9b134d7dfe6886bd" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.KeyVault/vaults/wings-prod-kv/secrets/wings-prod-privatekey" -> (known after apply)
        tags                    = {
            "DiscordControl" = "true"
            "application"    = "pterodactyl"
            "environment"    = "prod"
        }
      ~ version                 = "05331dd62be84eca9b134d7dfe6886bd" -> (known after apply)
      ~ versionless_id          = "https://wings-prod-kv.vault.azure.net/secrets/wings-prod-privatekey" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pterodactyl_node["wings"].azurerm_key_vault_secret.publickey[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "publickey" {
      ~ id                      = "https://wings-prod-kv.vault.azure.net/secrets/wings-prod-publickey/3223fdca918443319188e999e237bc3e" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.KeyVault/vaults/wings-prod-kv" # forces replacement -> (known after apply) # forces replacement
        name                    = "wings-prod-publickey"
      ~ resource_id             = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.KeyVault/vaults/wings-prod-kv/secrets/wings-prod-publickey/versions/3223fdca918443319188e999e237bc3e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.KeyVault/vaults/wings-prod-kv/secrets/wings-prod-publickey" -> (known after apply)
        tags                    = {
            "DiscordControl" = "true"
            "application"    = "pterodactyl"
            "environment"    = "prod"
        }
      ~ version                 = "3223fdca918443319188e999e237bc3e" -> (known after apply)
      ~ versionless_id          = "https://wings-prod-kv.vault.azure.net/secrets/wings-prod-publickey" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pterodactyl_node["wings"].azurerm_key_vault_secret.username[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "username" {
      ~ id                      = "https://wings-prod-kv.vault.azure.net/secrets/wings-prod-username/221d63f1e9bf437c9a1154abf2ffe4e8" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.KeyVault/vaults/wings-prod-kv" # forces replacement -> (known after apply) # forces replacement
        name                    = "wings-prod-username"
      ~ resource_id             = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.KeyVault/vaults/wings-prod-kv/secrets/wings-prod-username/versions/221d63f1e9bf437c9a1154abf2ffe4e8" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.KeyVault/vaults/wings-prod-kv/secrets/wings-prod-username" -> (known after apply)
        tags                    = {
            "DiscordControl" = "true"
            "application"    = "pterodactyl"
            "environment"    = "prod"
        }
      ~ version                 = "221d63f1e9bf437c9a1154abf2ffe4e8" -> (known after apply)
      ~ versionless_id          = "https://wings-prod-kv.vault.azure.net/secrets/wings-prod-username" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pterodactyl_node["wings"].azurerm_linux_virtual_machine.this must be replaced
-/+ resource "azurerm_linux_virtual_machine" "this" {
      ~ computer_name                                          = "wings-prod-vm" -> (known after apply)
      ~ disk_controller_type                                   = "SCSI" -> (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Compute/virtualMachines/wings-prod-vm" -> (known after apply)
      ~ location                                               = "uksouth" # forces replacement -> (known after apply) # forces replacement
        name                                                   = "wings-prod-vm"
      ~ network_interface_ids                                  = [
          - "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Network/networkInterfaces/wings-prod-nic",
        ] -> (known after apply)
      ~ private_ip_address                                     = "10.200.0.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.200.0.4",
        ] -> (known after apply)
      ~ public_ip_address                                      = "51.143.187.54" -> (known after apply)
      ~ public_ip_addresses                                    = [
          - "51.143.187.54",
        ] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "DiscordControl" = "true"
            "application"    = "pterodactyl"
            "environment"    = "prod"
        }
      ~ virtual_machine_id                                     = "e9e9158c-24c9-4145-93e9-2f2eb691c9cf" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (27 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "639552e7-9fde-4116-9f69-dba32041c3b3" -> (known after apply)
          ~ tenant_id    = "efc9b6c0-5193-43b1-a5a7-2ef3f29cd613" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ os_disk {
          ~ name                             = "wings-prod-vm_disk1_0d403804926140e3997a097c0db659f3" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ termination_notification {
          + admin_password                                         = (known after apply)
          + admin_username                                         = (known after apply)
          + allow_extension_operations                             = (known after apply)
          + availability_set_id                                    = (known after apply)
          + bypass_platform_safety_checks_on_user_schedule_enabled = (known after apply)
          + capacity_reservation_group_id                          = (known after apply)
          + computer_name                                          = (known after apply)
          + custom_data                                            = (known after apply)
          + dedicated_host_group_id                                = (known after apply)
          + dedicated_host_id                                      = (known after apply)
          + disable_password_authentication                        = (known after apply)
          + disk_controller_type                                   = (known after apply)
          + edge_zone                                              = (known after apply)
          + encryption_at_host_enabled                             = (known after apply)
          + eviction_policy                                        = (known after apply)
          + extensions_time_budget                                 = (known after apply)
          + id                                                     = (known after apply)
          + license_type                                           = (known after apply)
          + location                                               = (known after apply)
          + max_bid_price                                          = (known after apply)
          + name                                                   = (known after apply)
          + network_interface_ids                                  = (known after apply)
          + patch_assessment_mode                                  = (known after apply)
          + patch_mode                                             = (known after apply)
          + platform_fault_domain                                  = (known after apply)
          + priority                                               = (known after apply)
          + private_ip_address                                     = (known after apply)
          + private_ip_addresses                                   = (known after apply)
          + provision_vm_agent                                     = (known after apply)
          + proximity_placement_group_id                           = (known after apply)
          + public_ip_address                                      = (known after apply)
          + public_ip_addresses                                    = (known after apply)
          + reboot_setting                                         = (known after apply)
          + resource_group_name                                    = (known after apply)
          + secure_boot_enabled                                    = (known after apply)
          + size                                                   = (known after apply)
          + source_image_id                                        = (known after apply)
          + tags                                                   = (known after apply)
          + user_data                                              = (known after apply)
          + virtual_machine_id                                     = (known after apply)
          + virtual_machine_scale_set_id                           = (known after apply)
          + vm_agent_platform_updates_enabled                      = (known after apply)
          + vtpm_enabled                                           = (known after apply)
          + zone                                                   = (known after apply)
        } -> (known after apply)

        # (2 unchanged blocks hidden)
    }

  # module.pterodactyl_node["wings"].azurerm_network_interface.this must be replaced
-/+ resource "azurerm_network_interface" "this" {
      - accelerated_networking_enabled = false -> null
      ~ applied_dns_servers            = [] -> (known after apply)
      - dns_servers                    = [] -> null
      ~ id                             = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Network/networkInterfaces/wings-prod-nic" -> (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      - ip_forwarding_enabled          = false -> null
      ~ location                       = "uksouth" # forces replacement -> (known after apply) # forces replacement
      ~ mac_address                    = "7C-1E-52-1D-EB-D5" -> (known after apply)
        name                           = "wings-prod-nic"
      ~ private_ip_address             = "10.200.0.4" -> (known after apply)
      ~ private_ip_addresses           = [
          - "10.200.0.4",
        ] -> (known after apply)
        tags                           = {
            "DiscordControl" = "true"
            "application"    = "pterodactyl"
            "environment"    = "prod"
        }
      ~ virtual_machine_id             = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Compute/virtualMachines/wings-prod-vm" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "wings-prod-ipconfig"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address                                 = "10.200.0.4" -> (known after apply)
          ~ public_ip_address_id                               = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Network/publicIPAddresses/wings-prod-pip" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.pterodactyl_node["wings"].azurerm_virtual_machine_extension.aadlogin[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "aadlogin" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Compute/virtualMachines/wings-prod-vm/extensions/AADSSHLoginForLinux" -> (known after apply)
        name                        = "AADSSHLoginForLinux"
      - provision_after_extensions  = [] -> null
      - tags                        = {} -> null
      ~ virtual_machine_id          = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Compute/virtualMachines/wings-prod-vm" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.pterodactyl_node["wings"].azurerm_virtual_machine_extension.customscript must be replaced
-/+ resource "azurerm_virtual_machine_extension" "customscript" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Compute/virtualMachines/wings-prod-vm/extensions/BootstrapVM" -> (known after apply)
        name                        = "BootstrapVM"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "DiscordControl" = "true"
            "application"    = "pterodactyl"
            "environment"    = "prod"
        }
      ~ virtual_machine_id          = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/games-prod-rg/providers/Microsoft.Compute/virtualMachines/wings-prod-vm" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 13 to add, 2 to change, 13 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":263,"Program":"tfcmt","SHA1":"","Target":"prod_gameserver","Vars":{}} -->